chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usbhs/processor/usbhs_p32mz1024ech124.h
PLIB_INLINE SFR_DATA _USBHS_ENDPOINT_BASE_ADDRESS_LEN(USBHS_MODULE_ID i)
{
    switch (i) {
        case USBHS_ID_0 :
            return _USBE0CSR0_DTWE_LENGTH;
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/usbhs_EndpointFIFO_Default.h"
#include "../templates/usbhs_SoftReset_Default.h"
#include "../templates/usbhs_Interrupts_Default.h"
#include "../templates/usbhs_HighSpeedSupport_Default.h"
#include "../templates/usbhs_ClockResetControl_Unsupported.h"
#include "../templates/usbhs_ModuleControl_Default.h"
#include "../templates/usbhs_EP0Status_Default.h"
#include "../templates/usbhs_TxEPStatus_Default.h"
#include "../templates/usbhs_RxEPStatus_Default.h"
#include "../templates/usbhs_EndpointOperations_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_USBHS_EndpointFIFOLoad(USBHS_MODULE_ID index, uint8_t endpoint, void* source, size_t nBytes)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_EndpointFIFOLoad_Default(index, endpoint, source, nBytes);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API int PLIB_USBHS_EndpointFIFOUnload(USBHS_MODULE_ID index, uint8_t endpoint, void* dest)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_EndpointFIFOUnload_Default(index, endpoint, dest);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (int)0;
    }
}

PLIB_INLINE_API void PLIB_USBHS_Endpoint0FIFOFlush(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_Endpoint0FIFOFlush_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_EndpointTxFIFOFlush(USBHS_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_EndpointTxFIFOFlush_Default(index, endpoint);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_EndpointRxFIFOFlush(USBHS_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_EndpointRxFIFOFlush_Default(index, endpoint);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_Endpoint0SetupPacketLoad(USBHS_MODULE_ID index, void* setupPacket, uint8_t deviceAddress, uint8_t hubAddress, uint8_t hubPortAddress, uint32_t speed)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_Endpoint0SetupPacketLoad_Default(index, setupPacket, deviceAddress, hubAddress, hubPortAddress, speed);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_Endpoint0SetupPacketUnload(USBHS_MODULE_ID index, void* dest)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_Endpoint0SetupPacketUnload_Default(index, dest);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_DeviceEPFIFOLoad(USBHS_MODULE_ID index, uint8_t endpoint, void* source, size_t nBytes)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_DeviceEPFIFOLoad_Default(index, endpoint, source, nBytes);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API int PLIB_USBHS_DeviceEPFIFOUnload(USBHS_MODULE_ID index, uint8_t endpoint, void* dest)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_DeviceEPFIFOUnload_Default(index, endpoint, dest);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (int)0;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_ExistsEndpointFIFO(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_ExistsEndpointFIFO_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USBHS_SoftResetEnable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_SoftResetEnable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_SoftResetDisable(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_SoftResetDisable_Default(index);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_ExistsSoftReset(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_ExistsSoftReset_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USBHS_InterruptEnableSet(USBHS_MODULE_ID index, USBHS_GEN_INTERRUPT generalInterrupts, USBHS_EPTXRX_INTERRUPT transmitInterrupts, USBHS_EPTXRX_INTERRUPT receiveInterrupts)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_InterruptEnableSet_Default(index, generalInterrupts, transmitInterrupts, receiveInterrupts);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API USBHS_EPTXRX_INTERRUPT PLIB_USBHS_TxInterruptFlagsGet(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_TxInterruptFlagsGet_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (USBHS_EPTXRX_INTERRUPT)0;
    }
}

PLIB_INLINE_API USBHS_EPTXRX_INTERRUPT PLIB_USBHS_RxInterruptFlagsGet(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_RxInterruptFlagsGet_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (USBHS_EPTXRX_INTERRUPT)0;
    }
}

